<?php 
// 1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.
echo "Задание 1<br>";

$a = 0;
while ($a <= 100){
	if ($a % 3 == 0 && $a != 0) {
	 	echo "$a; ";
	}
	$a++;
}


// // 2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
// 0 – ноль.
// 1 – нечетное число.
// 2 – четное число.
echo "<br><br>Задание 2<br>";

$b = 0;
do {
	if ($b === 0) {
		echo "<li>$b - это ноль;";
	}
	elseif ($b % 2 == 0) {
		echo "<li>$b - чётное число;";
	}
	else 
		echo "<li>$b - нечётное число;";
	$b++;
} 
while ($b <= 10);



// 3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:

//     Московская область:
//     Москва, Зеленоград, Клин
//     Ленинградская область:
//     Санкт-Петербург, Всеволожск, Павловск, Кронштадт
//     Рязанская область … (названия городов можно найти на maps.yandex.ru)
echo "<br><br>Задание 3<br>";

$russia = [
	"Московская область" => [
		"Москва","Видное","Химки",
	],
	"Приморский край" => [
		"Владивосток","Находка","Уссурийск"
	],
	"Хабаровский край" => [
		"Хабаровск","Комсомольск-на-Амуре","Вяземский"
	]
];
foreach ($russia as $district => $city) {
	echo "<br>$district:<br>".implode(", ", $city);
}
// print_r($russia);


// 4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).

// Написать функцию транслитерации строк.
echo "<br><br>Задание 4<br>";

function translit($text) {
	$alphabet = [
		"а" => "a",
		"б" => "b",
		"в" => "v",
		"г" => "g",
		"д" => "d",
		"е" => "e",
		"ё" => "e",
		"ж" => "zh",
		"з" => "z",
		"и" => "i",
		"й" => "y",
		"к" => "k",
		"л" => "l",
		"м" => "m",
		"н" => "n",
		"о" => "o",
		"п" => "p",
		"р" => "r",
		"с" => "s",
		"т" => "t",
		"у" => "u",
		"ф" => "f",
		"х" => "kh",
		"ц" => "ts",
		"ч" => "ch",
		"ш" => "sh",
		"щ" => "shch",
		"ъ" => "",
		"ы" => "y",
		"ь" => "",
		"э" => "e",
		"ю" => "iu",
		"я" => "ia",
	];
	$text = mb_strtolower($text);
 	$text = strtr($text, $alphabet);
 	return $text;
}
echo translit("Привет! Как дела? Отлично!");


// 5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.
echo "<br><br>Задание 5<br>";

function spaces($text) {
	$text = str_replace(" ", "_", $text);
	return $text;
}
echo spaces("Hello! How are you doing?");

// 7. *Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. То есть выглядеть должно так:
// for (…){ // здесь пусто}
echo "<br><br>Задание 7<br>";
for ($i=0; $i <=10 ; print $i ." ", $i++);

// 8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».
echo "<br><br>Задание 8<br>";

function word($word) {
	$country = [
		"Московская область" => [
			"Москва","Видное","Химки",
		],
		"Приморский край" => [
			"Владивосток","Находка","Уссурийск"
		],
		"Хабаровский край" => [
			"Хабаровск","Комсомольск-на-Амуре","Вяземский"
		]
	];
	foreach ($country as $district => $area) {
		echo "<br>$district:<br>";
			foreach ($area as $city) {
				if (mb_substr($city, 0) == $word) {
					echo "$city<br>";
				}
				// else {
				// 	echo "Городов на заданную букву не найдено!<br>";
				// }
			};
	};
};
word("M");



// 9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах).
echo "<br><br>Задание 9<br>";

function urlTranslit($text) {
	$alphabet = [
		"а" => "a",
		"б" => "b",
		"в" => "v",
		"г" => "g",
		"д" => "d",
		"е" => "e",
		"ё" => "e",
		"ж" => "zh",
		"з" => "z",
		"и" => "i",
		"й" => "y",
		"к" => "k",
		"л" => "l",
		"м" => "m",
		"н" => "n",
		"о" => "o",
		"п" => "p",
		"р" => "r",
		"с" => "s",
		"т" => "t",
		"у" => "u",
		"ф" => "f",
		"х" => "kh",
		"ц" => "ts",
		"ч" => "ch",
		"ш" => "sh",
		"щ" => "shch",
		"ъ" => "",
		"ы" => "y",
		"ь" => "",
		"э" => "e",
		"ю" => "iu",
		"я" => "ia",
	];
	$text = mb_strtolower($text);
 	$text = strtr($text, $alphabet);
 	$uncorrectSymbols = ["!","@","?",",","."];
 	$text = str_replace($uncorrectSymbols, "_", $text);
 	return $text;
}
echo urlTranslit("Привет! Как дела? Отлично!");